//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// هنا عشان الموضوع يبقي واضح مفيش حاجه اجيب منها الدعاء او اي ايند بوينت دايركت يتجاب منها ف ده ال الاي بي اي اللي المفروض هيتعرض حسب الفيز وكل فيز ليها تايتل وديسكربشن والدعاء احاديث او دعاء علي حسب اللي موجود بس الفيز بتاعت الديورنج دي ادعيه بس لو شايف حاجه غلط ابقي قول
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
{
  "steps": [
    {
      "id": 1,
      "phase": "before",
      "title": "فضل العمره",
      "description": [
        "العمرة فرصة للتضرع إلى الله سبحانه وتعالى والدعاء لله في الأماكن المقدسة كالحرم الشريف له أثر عظيم، ويكون موضعًا لاستجابة الدعاء، بإذن الله و العمرة عبادة تجمع بين الطاعة والقرب من الله والدعاء والذكر ، وتحقق للمسلم التطهر من الذنوب، وتزيد من حسناته وتجدد إيمانة"
      ],
      "dua": [
        "عن ابي هريرة - رضي الله عنه - ان رسول الله صلي الله عليه وسلم قال [العمرة الي العمرة كفارة لما بينهما والحج المبرور ليس له جزاء الا الجنه"
      ]
    },
    {
      "id": 2,
      "phase": "before",
      "title": "الاحرام من الميقات",
      "description": [
        "يغتسل المسلم ويُفضل أن يتطيب قبل نية الإحرام والطيب للرجال فقط",
        "قص الاظافر وحلق العانه ونتف شعر الابط",
        "  لبس ملابس الاحرام والمراه لاتحرم بنقاب او قفازين",
        "ينوي نيه الاحرام ويقول"
      ],
      "dua": ["لبيك اللهم عمره لا رياء فيها ولا سمعه"]
    },
    {
      "id": 3,
      "phase": "before",
      "title": "الطريق الي مكه المكرمه",
      "description": [],
      "dua": [
        "لبيك اللهم لبيك، لبيك لا شريك لك لبيك، إن الحمد والنعمة لك والملك، لا شريك لك"
      ]
    },
    {
      "id": 4,
      "phase": "during",
      "title": "الدخول للمسجد الحرام ورؤيه الكعبه",
      "description": ["الدخول بالقدم اليمني وعند رؤيه الكعبه يقول"],
      "dua": [
        "اللهمَّ أنت السلامُ، ومنك السلامُ، فحَيِّنَا ربنا بالسلامِ، اللهمَّ زِدْ هذا البيتَ تشريفًا وتعظيمًا ومهابةً وزِدْ من حجَّهُ أو اعتمرَهُ تكريمًا وتشريفًا وتعظيمًا وبِرًّا"
      ]
    },
    {
      "id": 5,
      "phase": "during",
      "title": "بدايه الطواف",
      "description": [
        "من شروط الطواف الطهاره من الحدث الاكبر والاصغر",
        "عند بدايه الطواف يكشف الرجل عن كتفه الايمن ونبدا الطواف من عند الحجر الاسود ويقبله ان استطاع ويستلمه بيمينه ويقول"
      ],
      "dua": ["بسم الله والله أكبر"]
    },
    {
      "id": 6,
      "phase": "during",
      "title": "الطواف",
      "description": [
        "الطواف سبع اشواط",
        "يستحب الرمل عند اول ثلاث اشواط للرجال ان لم يكن هناك زحام",
        "إذا وصل المعتمر إلى الركن اليماني (الركن الذي يسبق الحجر الأسود) يُسن أن يستلمه بيده إن أمكن، دون تقبيل أو إشارة. وإذا تعذر ذلك، فلا يشير إليه.",
        "طوال الطواف نذكر الله وندعو ونستغفر",
        "بين الركن اليماني والحجر الأسود يُستحب تكرار الدعاء"
      ],
      "dua": ["ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار"]
    },
    {
      "id": 7,
      "phase": "after",
      "title": "بعد الطواف",
      "description": [
        "بعد الانتهاء من إكمال سبعة أشواط من  الطواف حول الكعبة يُسنّ للمسلم أن يصلي ركعتين خلف مقام  إبراهيم عليه السلام  إن أمكن، وإذا لم يستطع لا بأس بأن يصلي أي مكان داخل المسجد الحرام",
        "في هاتين الركعتين، يُستحب قراءة سورة الفاتحة، ثم سورة الكافرون في الركعة الأولى، وسورة الإخلاص في الركعة الثانية.",
        "ثم تشرب ماء زمزم"
      ],
      "dua": []
    },
    {
      "id": 8,
      "phase": "saai",
      "title": "الصفا والمروه",
      "description": [],
      "dua": [
        "إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّـهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا وَمَن تَطَوَّعَ خَيْرًا فَإِنَّ اللَّـهَ شَاكِرٌ عَلِيمٌ"
      ]
    },
    {
      "id": 9,
      "phase": "saai",
      "title": "بدايه السعي",
      "description": [
        "يبدأ من عند الصفا ويستحب أن يستقبل القبلة ويحمد الله ويكبره ويقول "
      ],
      "dua": [
        "لا إله إلا الله والله أكبر، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده"
      ]
    },
    {
      "id": 10,
      "phase": "saai",
      "title": "السعي",
      "description": [
        "يبدأ السعي من الصفا الي المروه وعند الضوء الاخضر يسرع الرجال فقط في المشي الي جبل المروه وهذا يعتبر شوط واحد ونكرر الي ان نصل الي سبع اشواط",
        "ننتهي عند جبل المروه ويستحب أن يستقبل القبلة ويحمد الله ويكبره ويقول "
      ],
      "dua": [
        "لا إله إلا الله والله أكبر، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده"
      ]
    },
    {
      "id": 11,
      "phase": "saai",
      "title": "بعد السعي",
      "description": [
        "فإذا كمل السعي يحلق الرجل رأسه أو يقصره والحلق أفضل وإذا كان قدومه مكة قريبًا من وقت الحج فالتقصير في حقه أفضل ليحلق بقية رأسه في الحج. أما المرأة فتجمع شعرها وتأخذ منه قدر أنملة فأقل، فإذا فعل المحرم ما ذكر فقد تمت عمرته، والحمد لله. وحل له كل شيء حرم عليه بالإحرام."
      ],
      "dua": []
    }
  ]
}
